
#coding:utf-8
import pyodbc as p
import pandas as pd
import sys 
reload(sys) 
sys.setdefaultencoding("utf-8")

conn = p.connect("DSN=MyDB;UID=tradehero_api;PWD=__sa90070104th__")


sql = "SELECT id \
      ,symbol as code \
      ,date \
      ,基本每股收益(元) \
      ,净利润(万元) \
      ,净利润同比增长率(%) \
      ,扣非净利润(万元) \
      ,营业总收入(万元) \
      ,营业总收入同比增长率(%) \
      ,每股净资产(元) \
      ,净资产收益率(%) \
      ,净资产收益率-摊薄(%) \
      ,资产负债比率(%) \
      ,每股资本公积金(元) \
      ,每股未分配利润(元) \
      ,每股经营现金流(元) \
      ,现金及存放中央银行款项(万元) \
      ,存放同业款项(万元) \
      ,交易性金融资产(万元) \
      ,发放贷款及垫款(万元) \
      ,应收利息(万元) \
      ,长期股权投资(万元) \
      ,可供出售金融资产(万元) \
      ,投资性房地产(万元) \
      ,固定资产(万元) \
      ,无形资产(万元) \
      ,资产总计(万元) \
      ,向中央银行借款(万元) \
      ,同业及其他金融机构存放款项(万元) \
      ,交易性金融负债(万元) \
      ,吸收存款(万元) \
      ,应付职工薪酬(万元) \
      ,应交税费(万元) \
      ,应付利息(万元) \
      ,负债合计(万元) \
      ,股本(万元) \
      ,盈余公积(万元) \
      ,未分配利润(万元) \
      ,少数股东权益(万元) \
      ,股东权益合计(万元) \
      ,利息收入(万元) \
      ,利息支出(万元) \
      ,利息净收入(万元) \
      ,手续费及佣金净收入(万元) \
      ,营业总成本(万元) \
      ,营业利润(万元) \
      ,投资收益(万元) \
      ,汇兑收益(万元) \
      ,公允价值变动收益(万元) \
      ,资产减值损失(万元) \
      ,管理费用(万元) \
      ,利润总额(万元) \
      ,所得税(万元) \
      ,客户存款和同业存放款项净增加额(万元) \
      ,客户贷款及垫款净增加额(万元) \
      ,支付的各项税费(万元) \
      ,支付给职工以及为职工支付的现金(万元) \
      ,经营现金流入(万元) \
      ,经营现金流出(万元) \
      ,经营现金流量净额(万元) \
      ,投资现金流入(万元) \
      ,投资现金流出(万元) \
      ,投资现金流量净额(万元) \
      ,筹资现金流入(万元) \
      ,筹资现金流出(万元) \
      ,筹资现金流量净额(万元) \
      ,汇率变动对现金的影响(万元) \
      ,现金及现金等价物净增加额(万元) \
      ,每股收益同比增长率(%) \
      ,营业收入同比增长率(%) \
      ,净资产收益率同比增长率(%) \
      ,流动比率() \
      ,速动比率() \
      ,保守速动比率() \
      ,产权比率() \
      ,营业周期() \
      ,存货周转天数() \
      ,应收账款周转天数() \
      ,存货周转率() \
      ,销售毛利率(%) \
      ,货币资金(万元) \
      ,应收账款(万元) \
      ,预付账款(万元) \
      ,应收股利(万元) \
      ,其他应收款(万元) \
      ,存货(万元) \
      ,一年内到期的非流动资产(万元) \
      ,其他流动资产(万元) \
      ,流动资产合计(万元) \
      ,持有至到期投资(万元) \
      ,在建工程(万元) \
      ,固定资产清理(万元) \
      ,商誉(万元) \
      ,长期待摊费用(万元) \
      ,递延所得税资产(万元) \
      ,非流动资产合计(万元) \
      ,短期借款(万元) \
      ,应付票据(万元) \
      ,应付账款(万元) \
      ,预收账款(万元) \
      ,应付股利(万元) \
      ,其他应付款(万元) \
      ,一年内到期的非流动负债(万元) \
      ,其他流动负债(万元) \
      ,流动负债合计(万元) \
      ,长期借款(万元) \
      ,应付债券(万元) \
      ,长期应付款(万元) \
      ,专项应付款(万元) \
      ,预计负债(万元) \
      ,递延所得税负债(万元) \
      ,其他非流动负债(万元) \
      ,非流动负债合计(万元) \
      ,股本(万股) \
      ,资本公积金(万元) \
      ,减:库存股(万元) \
      ,盈余公积金(万元) \
      ,外币报表折算差额(万元) \
      ,归属于母公司股东权益合计(万元) \
      ,负债和股东权益总计(万元) \
      ,营业收入(万元) \
      ,营业成本(万元) \
      ,其中：联营企业和合营企业的投资收益(万元) \
      ,销售费用(万元) \
      ,财务费用(万元) \
      ,营业外收入(万元) \
      ,营业外支出(万元) \
      ,营业税金及附加(万元) \
      ,其他综合收益(万元) \
      ,综合收益总额(万元) \
      ,归属于母公司股东的综合收益总额(万元) \
      ,归属于少数股东的综合收益总额(万元) \
      ,销售商品、提供劳务收到的现金(万元) \
      ,收到的税费与返还(万元) \
      ,处置固定资产、无形资产的现金(万元) \
      ,处置子公司及其他收到的现金(万元) \
      ,购建固定资产和其他支付的现金(万元) \
      ,投资支付的现金(万元) \
      ,取得子公司现金净额(万元) \
      ,支付其他与投资的现金(万元) \
      ,吸收投资收到现金(万元) \
      ,其中子公司吸收现金(万元) \
      ,取得借款的现金(万元) \
      ,收到其他与筹资的现金(万元) \
      ,偿还债务支付现金(万元) \
      ,分配股利、利润或偿付利息支付的现金(万元) \
      ,其中子公司支付股利(万元) \
      ,支付其他与筹资的现金(万元) \
      ,应收票据(万元) \
      ,长期应收款(万元) \
      ,工程物资(万元) \
      ,生产性生物资产(万元) \
      ,油气资产(万元) \
      ,专项储备(万元) \
      ,一般风险准备(万元) \
      ,客户资金存款(万元) \
      ,交易席位费(万元) \
      ,可出售金融资产(万元) \
      ,总资产(万元) \
      ,代理买卖证券款(万元) \
      ,代理承销证券款(万元) \
      ,其他负债(万元) \
      ,总负债(万元) \
      ,代理买卖证券业务净收入(万元) \
      ,证券承销业务净收入(万元) \
      ,受托客户资产管理业务净收入(万元) \
      ,取得投资收益收到的现金(万元) \
      ,收回投资收到的现金(万元) \
      ,定期存款(万元) \
      ,保户质押贷款(万元) \
      ,应收保费(万元) \
      ,独立账户资产(万元) \
      ,其他资产(万元) \
      ,预收保费(万元) \
      ,应付手续费及佣金(万元) \
      ,应付赔付款(万元) \
      ,应付保单红利(万元) \
      ,独立账户负债(万元) \
      ,资本公积(万元) \
      ,已赚保费(万元) \
      ,保险业务收入(万元) \
      ,提取保险责任准备金(万元) \
      ,赔付支出(万元) \
      ,退保金(万元) \
      ,分保费用(万元) \
      ,保单红利支出(万元) \
      ,收到原保险合同保费取得的现金(万元) \
      ,保户储金及投资款净增加额(万元) \
      ,支付原保险合同赔付款项的现金(万元) \
      ,支付保单红利的现金(万元) \
  FROM dbo.FinancialData"

sql2 = "select * from dbo.FinancialData where symbol = ?"

# df = pd.read_sql('SELECT PricingWorker_HeartBeatUtc, PricingWorker_LastUpdateUtc, id \
#   FROM dbo.PricingWorker_Heartbeat', con = conn)

df = pd.read_sql(sql2 , con = conn, params = ['000001'] )

print(df)

conn.close()




